fixtures/request_R.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:clm="http://comarch.pl/loyalty/web/ws/clm">
    <soapenv:Header/>
    <soapenv:Body>
        <clm:ProcessTransaction>
            <RequestData>
                <type>R</type>
                <partnerId>73</partnerId>
                <locationCode>218</locationCode>
                <terminalCode>1</terminalCode>
                <transactionDate>200630111556</transactionDate>
                <receiptId>1</receiptId>
                <online>true</online>
                <cardno>7789005176445159</cardno>
                <amount>200</amount>
                <points_pbp>880</points_pbp>
                <amount_pbp>1</amount_pbp>
                <payment>
                    <item>
                        <type>loyaltyPoints</type>
                        <amount>100</amount>
                    </item>
                    <item>
                        <type>loyaltyDiscount</type>
                        <amount>11</amount>
                    </item>
                </payment>
                <products>
                    <item>
                        <groupCode>0</groupCode>
                        <code>200</code>
                        <quantity>3.00</quantity>
                        <amount>100.00</amount>
                    </item>
                    <item>
                        <groupCode>144</groupCode>
                        <code>3490141</code>
                        <quantity>1.00</quantity>
                        <amount>100.00</amount>
                    </item>
                </products>
                <pos_version>NQ</pos_version>
                <ip_cash_desk>10.152.152.79</ip_cash_desk>
            </RequestData>
        </clm:ProcessTransaction>
    </soapenv:Body>
</soapenv:Envelope>
